'===============================Git================================='
# Git - это распределенная система контроля версий. Система для отслеживания и ведения истории изменения файлов в нашем проекте. При помощи git можно оргранизовать командную работу

# Репозиторий - это хранилище нашего кода и истории его изменений
# Github - это вебсайт для размещения git-репозиториев для совместной разработке проектов.

'''
git add . - добавит все файлы в индекс
git commit -m 'comment' - зафиксировать изменения
git log - посмотреть историю коммитов
git checkout - перемещает между ветками
git branch - показывает список всех наших веток
git branch -M <name> -меняет название ветки на новое
git status - показывает состояние всех файлов

'''
